import React from 'react';
import style from './defaultBlock.module.scss';

export default function DefaultBlock() {
  return(
    <div className={style.defaultBlock}>
      <div className={style.unit}>
        <div className={style.icon}>
          <svg viewBox="0 0 300 300"><path d="M278.6,42.9c0-23.6-19.2-42.9-42.9-42.9s-42.9,19.2-42.9,42.9c0,15.8,8.6,29.7,21.4,37.1v35.4L150,147.5 l-64.3-32.1V79.9c12.8-7.4,21.4-21.3,21.4-37.1C107.1,19.2,87.9,0,64.3,0S21.4,19.2,21.4,42.9c0,15.8,8.6,29.7,21.4,37.1v61.9 l85.7,42.9v35.4c-12.8,7.4-21.4,21.3-21.4,37.1c0,23.6,19.2,42.9,42.9,42.9s42.9-19.2,42.9-42.9c0-15.8-8.6-29.7-21.4-37.1v-35.4 l85.7-42.9V79.9C269.9,72.5,278.6,58.7,278.6,42.9z M64.3,21.4c11.8,0,21.4,9.6,21.4,21.4s-9.6,21.4-21.4,21.4s-21.4-9.6-21.4-21.4 S52.5,21.4,64.3,21.4z M150,278.6c-11.8,0-21.4-9.6-21.4-21.4c0-11.8,9.6-21.4,21.4-21.4s21.4,9.6,21.4,21.4 C171.4,269,161.8,278.6,150,278.6z M235.7,64.3c-11.8,0-21.4-9.6-21.4-21.4s9.6-21.4,21.4-21.4s21.4,9.6,21.4,21.4 S247.5,64.3,235.7,64.3z"></path></svg>
        </div>
        <h4>
          Открытый исходный код
        </h4>
        <p>
          Весь код проекта находится в свободном доступе и открыт всем желающим для улучшения и модификаций.
        </p>
      </div>
      <div className={style.unit}>
        <div className={style.icon}>
          <svg viewBox="0 0 300 300"><rect x="81.8" y="13.6" width="54.5" height="272.7"></rect><rect y="204.5" width="54.5" height="81.8"></rect><rect x="163.6" y="150" width="54.5" height="136.4"></rect><rect x="245.5" y="95.5" width="54.5" height="190.9"></rect></svg>
        </div>
        <h4>
          Углубленные данные
        </h4>
        <p>
          Обработка файлов повторов предоставляет высоко детализированные данные матча.
        </p>
      </div>
      <div className={style.unit}>
        <div className={style.icon}>
          <svg viewBox="0 0 300 300"><rect x="138" y="116.5" transform="matrix(0.7071 0.7071 -0.7071 0.7071 145.5402 -72.8379)" width="45.5" height="45.5"></rect><rect x="52.3" y="141.6" transform="matrix(0.7071 0.7071 -0.7071 0.7071 181.0483 12.848)" width="45.5" height="166.7"></rect><rect x="150" y="0" width="21.4" height="42.8"></rect><rect x="233.3" y="34.5" transform="matrix(-0.7071 -0.7071 0.7071 -0.7071 377.0973 268.0186)" width="21.4" height="42.8"></rect><rect x="66.6" y="34.5" transform="matrix(0.7071 -0.7071 0.7071 0.7071 -16.9125 71.0886)" width="21.4" height="42.8"></rect><rect x="233.3" y="201.2" transform="matrix(0.7071 -0.7071 0.7071 0.7071 -85.918 237.758)" width="21.4" height="42.8"></rect><rect x="257.2" y="128.5" width="42.8" height="21.4"></rect></svg>
        </div>
        <h4>
          Бесплатно
        </h4>
        <p>
          Серверы финансируются за счёт спонсоров и добровольцы поддерживают код, поэтому сервис предоставляется бесплатно.
        </p>
      </div>
    </div>
  )
}